Tekla Open API Reference for Tekla Structures 2025
NormalLineType.Inequality Operator
 Returns true if the current object and the given object are not equal.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator !=(
	NormalLineType a,
	NormalLineType b
)
Public Shared Operator <> (
	a As NormalLineType,
	b As NormalLineType
) As Boolean
Parameters
a
Type: Tekla.Structures.Drawing.NormalLineType
The first object we wish to check the inequality with.
b
Type: Tekla.Structures.Drawing.NormalLineType
The second object we wish to check the inequality with.
Return Value
Type: Boolean
True if the objects are not equal.
See Also
Reference
NormalLineType Class
Tekla.Structures.Drawing Namespace